// вопрос 1 - Для чего нужен Virtual DOM в React?

/*
*
* Виртуальный DOM - это концепция программирования, в которой «виртуальное» представление пользовательского интерфейса 
* хранится в памяти и синхронизируется с «настоящим» DOM при помощи библиотеки, такой как ReactDOM. 

* Эта техника позволяет улучшить производительность на клиентской стороне, избегая прямой работы с 
* DOM-деревом путем работы с легким JavaScript-объектом, имитирующем DOM-дерево. 

* Изначально React вносит все изменения в виртуальный DOM, а потом применяет их в настоящем DOM-е
*
*/
