// Объявление
// Объявить две переменные - одну менять нельзя будет, другую можно
// присвоить им любые значения и вывести их значения в консоль

let a = 10;

console.log(a);

let b = 5;

console.log(b);

///////////////////////////////////////////////////////////////////////

// Изменение
// Попытаться изменить значения объявленных выше переменных
// и вывести их новые значения в консоль

// a = 3;

// console.log(a);

// b = 2;

// console.log(b);

/////////////////////////////////////////////////////////////////////////

// Повторное объявление
// Объявить по две переменные с одинаковым именем (let/const), но разными значениями
// вывести в консоль их значения

// const a = 2;

// let b = 3;
